# list(리스트): 여러가지 데이터를 하나의 변수에 저장할 수 있음.
a_list = 0
a = [1, "사과", 3.14, True, [1, 2, 3], {1, 2}, a_list, None, (1, 2, )]

print(type(a), type(a[0]), type(a[1]), type(a[2]), type(a[3]), 
      type(a[4]), type(a[5]), type(a[6]), type(a[7]), type(a[8]))
     # tuple(튜플): 리스트와 비슷하지만 수정할 수 없는 데이터형
     # set(집합): 중복된 값을 가질 수 없는 데이터형
     # Nonetype(없음): 값이 없음을 나타내는 데이터형

#리스트 값 생성
number = [1, 2, 3, 4, 5]
print(number)

#리스트 값 수정
number[0] = 10
print(number) #인덱스 0번이 1에서 10으로 수정됨

#리스트 값 수정 + 연산 문제 출제될 수 있음

# 슬라이싱(slicing)
a = [1, 2, 3, 4, 5]
print(a[1:3]) #인덱스 1부터 3전까지(2까지) 출력
print(a[:3]) #인덱스 0부터 3전까지(2까지) 출력
print(a[1:]) #인덱스 1부터 끝까지 출력
print(a[:]) #전체 출력

#같은 값 여러 개 만들기
numbers = [0, 1, 2] * 10
print(numbers) #리스트가 이어짐(합쳐짐)
#[0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, ...]

#리스트 관련 명령어
bucket_list = ["국내 일주 여행하기","해외 배낭여행 떠나기","오로라 보기","스카이다이빙 체험하기","마라톤 완주하기",
                "책 100권 읽기","자격증 취득하기","외국어 능숙하게 배우기","악기 하나 연주하기","작곡해보기","웹소설 완결하기",
                "개인 블로그 운영하기","코딩으로 게임 만들기","앱 출시하기","과학 탐구 프로젝트 진행하기","별 관측하기","캠핑하기",
                "패러글라이딩 타기","바다에서 스쿠버다이빙 하기","일출 명소 방문하기","봉사활동 100시간 달성하기","TED 형식 발표 해보기",
                "사진전 열기","드론 촬영하기","요리 30가지 배우기","자전거 국토종주하기","대학 연구실 탐방하기","스포츠 경기 직관하기",
                "콘서트 가기","나만의 책 출판하기","창업 경험해보기","특허 출원하기","환경보호 캠페인 참여하기","가족과 여행하기",
                "친구들과 우정 여행하기","건강한 생활습관 만들기","매일 운동 1년 유지하기","수영 배우기","등산으로 정상 정복하기",
                "세계문화유산 방문하기","별자리 공부하기","천체망원경 사용해보기","교환학생 경험하기","장학금 받기","경제적 자립 이루기",
                "주식 투자 공부하기","역사 유적지 탐방하기","박물관 20곳 방문하기","나무 심기 프로젝트 참여하기","일기 1년 쓰기",
                "1인 방송 해보기","단편영화 제작하기","대회 수상하기","과학관 탐방하기","새로운 취미 5개 도전하기","24시간 디지털 디톡스 해보기",
                "나만의 연구 보고서 작성하기","꿈의 직업 체험하기","인생 목표 정리하기","후배 멘토링 하기","교육 봉사 참여하기",
                "해돋이와 해넘이 모두 보기","세계 음식 50종 먹어보기","야구장 10개 구장 방문하기","국가대표 경기 관람하기",
                "자신만의 명언 만들기","타임캡슐 묻기","미래의 나에게 편지 쓰기","평생 기억에 남을 도전 한 가지 완수하기"
] # ㅋㅋㅋ 지피티 양산 버킷리스트


#리스트 관련 주요 매서드 
bucket_list.append("공부하기") #값을 리스트에 추가(append)

bucket_list.insert(0, "공부하기") #값을 리스트 정해진 위치에 추가(insert)

bucket_list.remove("공부하기") #값을 리스트에서 제거(remove)

bucket_list.reverse() #순서를 역순으로 (reverse)

bucket_list.sort() #오름차순으로 정렬 영-한 (sort)

bucket_list.sort(reverse= True) #내림차순으로 정렬(sort)

bucket_list.pop() #마지막 요소를 제거& 반환(pop), ()에 인덱스 입력 시 해당 인덱스 요소를 제거&번환 

# 리스트 관련 내장 함수
len(bucket_list) #리스트 요소의 총 갯수(len())